Revit 2027 API
BuiltInFailures.SketchFailures.BoundaryNoOverlap Property
 The split sketch is out of the boundary of split element sketch..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BoundaryNoOverlap { get; }
Public Shared ReadOnly Property BoundaryNoOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BoundaryNoOverlap {
	FailureDefinitionId^ get ();
}
static member BoundaryNoOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace